{"keras_version": "1.2.0", "config": [{"config": {"batch_input_shape": [null, 1, 50, 37], "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "nb_row": 3, "name": "convolution2d_1", "border_mode": "same", "subsample": [1, 1], "input_dtype": "float32", "nb_filter": 32, "W_regularizer": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "nb_row": 3, "name": "convolution2d_2", "border_mode": "same", "subsample": [1, 1], "nb_filter": 32, "W_regularizer": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "nb_row": 3, "name": "convolution2d_3", "border_mode": "same", "subsample": [1, 1], "nb_filter": 64, "W_regularizer": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "nb_row": 3, "name": "convolution2d_4", "border_mode": "same", "subsample": [1, 1], "nb_filter": 64, "W_regularizer": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "W_constraint": {"axis": 0, "name": "MaxNorm", "m": 3}, "bias": true, "input_dim": 6912, "output_dim": 1024, "W_regularizer": null, "name": "dense_1", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "softmax", "activity_regularizer": null, "W_constraint": null, "bias": true, "input_dim": 1024, "output_dim": 34, "W_regularizer": null, "name": "dense_2", "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential"}